#pragma once
#include "CProductCalc.h"

void SetHaveProduct(CSmartArray& arr)
{
	arr.Add(_T("пшеница"), 2);
	arr.Add(_T("кукуруза"), 5);
	arr.Add(_T("морковь"), 5);
	arr.Add(_T("сахарный тросник"), 5);
	arr.Add(_T("хлопок"), 2);
	arr.Add(_T("клубника"), 1);
	arr.Add(_T("томат"), 2);
	arr.Add(_T("сосна"), 4);
	arr.Add(_T("картофель"), 4);
	arr.Add(_T("какао"), 13);
	arr.Add(_T("каучук"), 2);
	arr.Add(_T("шелк"), 3);
	arr.Add(_T("перец"), 1);
	arr.Add(_T("хлеб"), 1);
	arr.Add(_T("печенье"), 1);
	arr.Add(_T("бублик"), 2);
	arr.Add(_T("пицца"), 2);
	arr.Add(_T("картофельный хлеб"), 0);
	arr.Add(_T("банановый хлеб"), 1);
	arr.Add(_T("сливки"), 1);
	arr.Add(_T("сыр"), 4);
	arr.Add(_T("масло"), 0);
	arr.Add(_T("йогурт"), 1);
	arr.Add(_T("персиковый йогурт"), 1);
	arr.Add(_T("хлопкова€ ткань"), 5);
	arr.Add(_T("пр€жа"), 4);
	arr.Add(_T("шелкова€ ткань"), 3);
	arr.Add(_T("рубашка"), 4);
	arr.Add(_T("свитер"), 3);
	arr.Add(_T("пальто"), 0);
	arr.Add(_T("шл€па"), 3);
	arr.Add(_T("платье"), 3);
	arr.Add(_T("костюм"), 1);
	arr.Add(_T("попкорн"), 4);
	arr.Add(_T("кукурузные чипсы"), 2);
	arr.Add(_T("√ранола"), 5);
	arr.Add(_T("чипсы"), 0);
	arr.Add(_T("милкшейк"), 2);
	arr.Add(_T("чизбургер"), 0);
	arr.Add(_T("сэндвич"), 1);
	arr.Add(_T("картошка фри"), 2);
	arr.Add(_T("печеный картофель"), 1);
	arr.Add(_T("резина"), 3);
	arr.Add(_T("пластик"), 4);
	arr.Add(_T("клей"),1 );
	arr.Add(_T("сахар"), 4);
	arr.Add(_T("сироп"), 2);
	arr.Add(_T("карамель"), 0);
	arr.Add(_T("медова€ карамель"), 2);
	arr.Add(_T("бумага"), 4);
	arr.Add(_T("бумажные полотенца"), 1);
	arr.Add(_T("обои"), 1);
	arr.Add(_T("книга"), 1);
	arr.Add(_T("мороженное"), 2);
	arr.Add(_T("фруктовый лед"), 3);
	arr.Add(_T("заморолженный йогурт"), 2);
	arr.Add(_T("эскимо"), 4);
	arr.Add(_T("ананасовый сорбет"), 2);
	arr.Add(_T("кекс"), 1);
	arr.Add(_T("шоколадный пирог"), 1);
	arr.Add(_T("пирожное"), 3);
	arr.Add(_T("пончик"), 0);
}